"use strict"; // видео 026, задачи с собеседования на понимание основ
// 1
// let x=5;
// alert(x++); // ответ 5

// 2
// console.log([ ] + false - null + true ); //пустой массив возвращает пустую строку, ответ NaN

// 3

// let y = 1;
// let x = y = 2;

// alert(x); // ответ 2 (последовательное присваивание)

// 4

// console.log([] + 1 + 2); // ответ 12, конкатинация


// 5

// alert( "1"[0]); // ответ 1

//6

// console.log(null && 2 && 1 && 0 && undefined); // ответ null (&& возвращает первое ложное значение)

// 7

// console.log(!!( 1 && 2 )===( 1 && 2 )); // ответ false

// 8

// alert( null || 2 && 3 || 4 ); // ответ 3
// И запинается на лжи
// ИЛИ запинается на правде

// 9

// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a == b); // не равны, т.к. это разные объекты

// 10

// alert( +"Infinity" ); // ответ Infinity(число)

// 11

// console.log("Ёжик" > "яблоко"); // вернет false, т.к. при посимаольном сравнении они не равны

// 12

console.log(0 || "" || 2 || undefined || true || falsе); // ответ 2, т.к. 2 явлется первым правдивым значением











